artillery.io/playground-rest.yml
config:
  target: "http://localhost:8080"
  plugins:
    expect: {}
  processor: "./playground-rest.js"
  phases:
    - duration: 20
      arrivalRate: 100
  http:
    timeout: 20
scenarios:
  - name: "Insert / update / delete N items"
    weight: 39
    flow:
      - loop:
          - get:
              url: "/rest/list"
              expect:
                - statusCode: 200
          - function: "setInsertItemData"
          - post:
              url: "/rest/insert"
              expect:
                - statusCode: 200
              json: "{{ InsertItem }}"
              capture:
                json: "$.ObjectNo"
                as: "InsertedItemObjectNo"
          - get: 
              url: "/rest/view/{{ InsertedItemObjectNo }}"
              expect:
                - statusCode: 200
              capture: 
                json: "$"
                as: "ViewItem"
          - think: 1
          - function: "setUpdateItemData"
          - put: 
              url: "/rest/update"
              expect:
                - statusCode: 200
              json: "{{ UpdateItem }}"
          - think: 1
          - get:
              url: "/rest/list"
              expect:
                - statusCode: 200
          - delete:
              url: "/rest/delete/{{ InsertedItemObjectNo }}"
        count: 20
  - name: "View N items"
    weight: 59
    flow:
      - loop:
          - get: 
              url: "/rest/list"
              expect:
                - statusCode: 200
              capture:
                - json: "$"
                  as: "Items"
          - function: "setRandomItemObjectNo"
          - get:
              url: "/rest/view/{{ RandomItemObjectNo }}"
              expect:
                - statusCode: 200
          - think: 1
          - get:
              url: "/rest/list"
              expect:
                - statusCode: 200
        count: 20
  - name: "Log current number of items"
    weight: 2
    flow:
      - think: 2
      - get:
          url: "/rest/list"
          expect:
            - statusCode: 200
          capture: 
            json: "$"
            as: "Items"
      - function: "setItemsLength"
      - log: "Total number of item: {{ ItemsLength }}"