artillery.io/playground.mvc.yml
config:
  target: "http://localhost:50053/"
  plugins:
    expect: {}
  processor: "./playground.mvc.js"
  phases:
    - duration: 60
      arrivalRate: 20
      rampTo: 100
      name: "Warm up the application"
    - duration: 60
      arrivalRate: 300
      name: "Increased load"
  http:
    timeout: 20
scenarios:
  - name: "Insert / update / delete N items"
    weight: 39
    flow:
      - get:
          url: "/home/index"
          expect:
            - statusCode: 200
      - loop:
          #- get:
          #    headers:
          #      Accept: "application/json"
          #    url: "/api/items"
          #    expect:
          #      - statusCode: 200
          - function: "setInsertItemData"
          - post:
              url: "/api/items"
              expect:
                - statusCode: 200
              json: "{{ InsertItem }}"
              capture:
                - json: "$"
                  as: "InsertedItem"
          - function: "setInsertedItemId"
          - get:
              url: "/api/items/{{ InsertedItemId }}"
              expect:
                - statusCode: 200
              headers:
                Accept: "application/json"
          - think: 1
          - function: "setUpdateItemData"
          - put:
              url: "/api/items"
              expect:
                - statusCode: 200
              json: "{{ UpdateItem }}"
          - think: 1
          - get: 
              url: "/api/items"
              expect:
                - statusCode: 200
              headers:
                Accept: "application/json"
          - delete:
              url: "/api/items/{{ InsertedItemId }}"
        count: 10
  - name: "View N items"
    weight: 59
    flow:
      - get:
          url: "/home/index"
          expect:
            - statusCode: 200
      - loop:
          - get:
              url: "/api/items"
              expect:
                - statusCode: 200
              headers:
                Accept: "application/json"
              capture:
                - json: "$"
                  as: "Items"
          - function: "saveRundomItemInfo"
          - get:
              url: "/api/items/{{ EditRandomItemId }}"
              expect:
                - statusCode: 200
              headers:
                Accept: "application/json"
          - think: 1
          #- get:
          #    url: "/api/items"
          #    expect:
          #      - statusCode: 200
          #    headers:
          #      Accept: "application/json"
        count: 10
  - name: "Log current number of items"
    weight: 2
    flow:
      - think: 2
      - get:
          url: "/api/items"
          expect:
            - statusCode: 200
          headers:
            Accept: "application/json"
          capture:
            - json: "$"
              as: "Items"
      - function: "setItemsLength"
      - log: "Total number of item: {{ ItemsLength }}"