artillery.io/playground.nova-ms.yml
config:
  target: "http://localhost:8080"
  plugins:
    expect: {}
  processor: "./playground.nova-ms.js"
  phases:
    - duration: 20
      arrivalRate: 100
  http:
    timeout: 20
scenarios:
  - name: "Insert / update / delete N items"
    weight: 39
    flow:
      - loop:
          - get:
              url: "/api/msitems"
              expect:
                - statusCode: 200
              headers:
                Accept: "application/json"
          - function: "setInsertItemData"
          - post:
              url: "/api/msitems"
              expect:
                - statusCode: 200
              json: "{{ InsertItem }}"
              capture:
                json: "$.Id"
                as: "InsertedItemId"
          - get: 
              url: "/api/msitems/{{ InsertedItemId }}"
              expect:
                - statusCode: 200
              headers:
                Accept: "application/json"
              capture: 
                json: "$"
                as: "ViewItem"
          - think: 1
          - function: "setUpdateItemData"
          - put: 
              url: "/api/msitems"
              expect:
                - statusCode: 200
              json: "{{ UpdateItem }}"
          - think: 1
          - get:
              url: "/api/msitems"
              expect:
                - statusCode: 200
              headers:
                Accept: "application/json"
          - delete:
              url: "/api/msitems/{{ InsertedItemId }}"
        count: 20
  - name: "View N items"
    weight: 59
    flow:
      - loop:
          - get: 
              url: "/api/msitems"
              expect:
                - statusCode: 200
              headers:
                Accept: "application/json"
              capture:
                - json: "$"
                  as: "Items"
          - function: "setRandomItemId"
          - get:
              url: "/api/msitems/{{ RandomItemId }}"
              expect:
                - statusCode: 200
              headers:
                Accept: "application/json"
          - think: 1
          - get:
              url: "/api/msitems"
              expect:
                - statusCode: 200
              headers:
                Accept: "application/json"
        count: 20
  - name: "Log current number of items"
    weight: 2
    flow:
      - think: 2
      - get:
          url: "/api/msitems"
          expect:
            - statusCode: 200
          headers:
            Accept: "application/json"
          capture: 
            json: "$"
            as: "Items"
      - function: "setItemsLength"
      - log: "Total number of item: {{ ItemsLength }}"