artillery.io/playground.yml
config:
  target: "http://localhost:8080/index"
  processor: "./playground.js"
  phases:
    - duration: 20
      arrivalRate: 100
  http:
    timeout: 20
  palindrom:
    timeout: 20000
scenarios:
  - engine: "palindrom"
    name: "Insert / update / delete N items"
    weight: 39
    flow:
      - loop:
          - updateModelFunction: "insertItem"
          - updateModelFunction: "emptyTrigger"
          - function: "saveInsertedItemInfo"
          - morphUrl: "{{ EditInsertedItemUri }}"
          - updateModelFunction: "setEditedItemGuid"
          - updateModelFunction: "setEditedItemIndex"
          - think: 1
          - updateModelFunction: "saveEditedItem"
          - think: 1
          - morphUrl: "/index"
          - updateModelFunction: "deleteSavedItem"
        count: 20
  - engine: "palindrom"
    name: "View N items"
    weight: 59
    flow:
      - loop:
          - function: "saveRundomItemInfo"
          - morphUrl: "{{ EditRandomItemUri }}"
          - think: 1
          - morphUrl: "/index"
        count: 20
  - engine: "palindrom"
    name: "Log current number of items"
    weight: 2
    flow:
      - think: 2
      - updateModelFunction: "emptyTrigger"
      - function: "logState"